# Working with MySql using sqlalchemy

### method1: Direct Connection

In [9]:
import os
os.chdir("E:\\D-drive\\DS\\data\\01 DS ML DL NLP and AI With Python Lab Copy\\02.LabData")
os.getcwd()

'E:\\D-drive\\DS\\data\\01 DS ML DL NLP and AI With Python Lab Copy\\02.LabData'

In [20]:
from sqlalchemy import create_engine
import pandas as pd

engine = create_engine("mysql+mysqlconnector://root:root@localhost:3306/organization")
#                                             uname /pwd/hostname/port no./db name
con = engine.connect()
rs = con.execute("select * from student")
df = pd.DataFrame(data=rs.fetchall(), columns=rs.keys())
df.head()
con.close()

In [50]:
df.head()

   sid firstname lastname  age   qual branch phone
0    1     pavan    kumar   24  btech   mech  8143
1    2    janaki      ram   26  btech   mech  9700
2    3     surya    kiran   29  mtech    ece  9742
3    4      jhan    shara   26  btech    cse  9951
4    5     vijay    kiran   28  btech    cse  8125

### method2: with conjugate

In [51]:
from sqlalchemy import create_engine;import pandas as pd

engine = create_engine("mysql+mysqlconnector://root:root@localhost:3306/organization")
with engine.connect() as con:
    rs = con.execute("select * from student")
    df = pd.DataFrame(data=rs.fetchall(), columns=rs.keys())
df.head()

   sid firstname lastname  age   qual branch phone
0    1     pavan    kumar   24  btech   mech  8143
1    2    janaki      ram   26  btech   mech  9700
2    3     surya    kiran   29  mtech    ece  9742
3    4      jhan    shara   26  btech    cse  9951
4    5     vijay    kiran   28  btech    cse  8125

### method3: using pandas

In [34]:
from sqlalchemy import create_engine;import pandas as pd

engine = create_engine("mysql+mysqlconnector://root:root@localhost:3306/organization")
con = engine.connect()
df = pd.read_sql("select * from student",con)
df.head()

   sid firstname lastname  age   qual branch phone
0    1     pavan    kumar   24  btech   mech  8143
1    2    janaki      ram   26  btech   mech  9700
2    3     surya    kiran   29  mtech    ece  9742
3    4      jhan    shara   26  btech    cse  9951
4    5     vijay    kiran   28  btech    cse  8125

## 2.Working with MySql connector package

In [1]:
# If pkg not available then install it 
# conda install -c anaconda mysql-connector-python

import mysql.connector
import pandas as pd

mydb = mysql.connector.connect(user="root",passwd="root",
                               host="localhost",database="organization")
rs = mydb.cursor()

InterfaceError: 2026 (HY000): SSL connection error: Failed to set ciphers to use

In [54]:
rs.execute("select * from student")
df = pd.DataFrame(data=rs.fetchall(), columns=rs.column_names)
df.head()

   sid firstname lastname  age   qual branch phone
0    1     pavan    kumar   24  btech   mech  8143
1    2    janaki      ram   26  btech   mech  9700
2    3     surya    kiran   29  mtech    ece  9742
3    4      jhan    shara   26  btech    cse  9951
4    5     vijay    kiran   28  btech    cse  8125